cfg/InformationRegisters/СведенияОбИнвалидностиФизлиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СведенияОбИнвалидностиФизлиц</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Инвалидность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ГруппыИнвалидности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдостоверениеСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдостоверениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдостоверениеДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfg/Enums/ГруппыИнвалидности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ГруппыИнвалидности</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПерваяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВтораяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТретьяГруппа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/InformationRegisters/СведенияОбИнвалидностиФизлиц/Forms/ФормаЗаписиДополнительная/Ext/Form/Module.bsl
Процедура УстановитьДоступность()
	
	ЭлементыФормы.Группа.Доступность = Инвалидность;
	ЭлементыФормы.УдостоверениеСерия.Доступность = Инвалидность;
	ЭлементыФормы.УдостоверениеНомер.Доступность = Инвалидность;
	ЭлементыФормы.УдостоверениеДатаВыдачи.Доступность = Инвалидность;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ФизЛицоПриОткрытии             = ФизЛицо;
	ПериодПриОткрытии              = Период;
	ГруппаПриОткрытии  			   = Группа;
	ДатаВыдачиПриОткрытии 		   = УдостоверениеДатаВыдачи;
	ИнвалидностьПриОткрытии  	   = Инвалидность;
	НомерПриОткрытии			   = УдостоверениеНомер;
	СерияПриОткрытии    		   = УдостоверениеСерия;
	КомментарийПриОткрытии 		   = Комментарий;
		
	Заголовок = Заголовок + " " + ФизЛицо.Наименование;
	
	Прочитать();
	
	// У записи обязательно должны быть заполнены реквизиты ФизЛицо и Период
	Если ФизЛицо.Пустая() Тогда
	    ФизЛицо = ФизЛицоПриОткрытии;
		Период  = ПериодПриОткрытии;
		// выставим по умолчанию
		Группа = Перечисления.ГруппыИнвалидности.ТретьяГруппа;
		Инвалидность = Истина;
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Если поменяли дату, то тогда новая  запись
	Если ПериодПриОткрытии <> Период Тогда
		
		// Если что-то поменяли тогда запишем 
		Если ГруппаПриОткрытии <> Группа ИЛИ
			ДатаВыдачиПриОткрытии <> УдостоверениеДатаВыдачи ИЛИ
			ИнвалидностьПриОткрытии <> Инвалидность ИЛИ
			НомерПриОткрытии <> УдостоверениеНомер ИЛИ
			СерияПриОткрытии <> УдостоверениеСерия ИЛИ
			КомментарийПриОткрытии <> Комментарий Тогда
		
			МенеджерЗаписи = РегистрыСведений.СведенияОбИнвалидностиФизлиц.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период   = Период;
			МенеджерЗаписи.ФизЛицо  = ФизЛицо;
			
			МенеджерЗаписи.Группа			   		= Группа;
			МенеджерЗаписи.УдостоверениеДатаВыдачи	= УдостоверениеДатаВыдачи;
			МенеджерЗаписи.Инвалидность		 		= Инвалидность;
			МенеджерЗаписи.УдостоверениеНомер       = УдостоверениеНомер;
			МенеджерЗаписи.УдостоверениеСерия       = УдостоверениеСерия;
			МенеджерЗаписи.Комментарий 		 		= Комментарий;
			
			МенеджерЗаписи.Записать();
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеЗаписи()
	
	Оповестить("ОбновитьФорму", Новый Структура("ИмяЭлемента","Инвалидность"), ФизЛицо);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

Процедура КнопкаИсторияНажатие(Элемент)
	
	ФормаРегистра = РегистрыСведений.СведенияОбИнвалидностиФизлиц.ПолучитьФормуСписка();
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.Значение = ФизЛицо;
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.ВидСравнения = ВидСравнения.Равно;
	ФормаРегистра.РегистрСведенийСписок.Отбор.ФизЛицо.Использование = Истина;
	ФормаРегистра.ЭлементыФормы.РегистрСведенийСписок.НачальноеОтображениеСписка = НачальноеОтображениеСписка.Конец;
	
	ФормаРегистра.Открыть();
	
КонецПроцедуры

Процедура ИнвалидностьПриИзменении(Элемент)
	
	Если НЕ Инвалидность Тогда
		Группа = Перечисления.ГруппыИнвалидности.ПустаяСсылка();
		УдостоверениеСерия = "";
		УдостоверениеНомер = "";
		УдостоверениеДатаВыдачи = "";
	КонецЕсли;
	
	УстановитьДоступность();
	
КонецПроцедуры
